Project1_constrained_risk_prediction/manuscript/manuscript.org
#+TITLE: Constrained Risk Prediction
#+Author: Hjalte Søberg Mikkelsen
#+Date: 
#+EMAIL: hjalte.soeberg.mikkelsen@regionh.dk
#+LaTeX_CLASS: org-article 
#+OPTIONS: toc:nil
#+LaTeX_HEADER:\usepackage{authblk}
#+LaTeX_HEADER:\author{Hjalte Søberg Mikkelsen}
#+LaTeX_HEADER:\affil{Steno Diabetes Center Copenhagen}
#+setupfile:~/emacs-genome/snps/org-templates/setup-all-purpose.org
# #+superman-org-export-target: pdf
#+BIBLIOGRAPHY: bibliography.bib
#+cite_export: csl ~/emacs/.csl-styles/apa.csl
\newpage

* Introduction

Accurate prediction of disease risk in the presence of competing risks remains a central challenge in clinical epidemiology. We target individualized predictions of the 5-year risk of type 2 diabetes (T2D) and simultaneously the 5-year risk of the competing risk of death. Common estimation methods, such as Fine-Gray regression and cause-specific Cox regression, target only one cause at a time and are not optimized for a given prediction time horizon.
We develop a loss-based estimation framework for the simultaneous prediction of multiple competing risks at a prespecified time horizon. Our approach provides a way to estimate a broad class of existing regression models for competing risks such that the resulting models are optimized for individualized risk prediction. Crucially, the framework enables seamless integration of flexible learner libraries and enables structural constraints during estimation. These may include coherence constraints that guarantee that the predicted risks respect the parameter space and domain-informed shape constraints (e.g., monotonicity in age). Estimation is achieved via constrained optimization of a differentiable loss function, such as the Brier score.


* The Problem

Assume we want to predict the risk of diabetes and the risk of death at some timepoint $\tau$, i.e. we want to predict the risk of each cause in a competing risks scenario. Denote $T$ as the time between time0 and the date of an event and $D\in\{0,1,...,K\}$ as the cause of the event, where $D = 0$ is censoring. Let $X = (X^1,...,X^p)$ be a p-dimensional vector of baseline covariates, which can both be numeric or categorical.\\
Consider a setting where $D\in\{0,1,2\}$ and $X$ is 1-dimensional. Define the cumulative hazard for $D = j$ as
#+begin_export latex
\begin{align*}
\Lambda_j(t|x) = \exp(x\beta_j)\Lambda_{0j}(t)
\end{align*}
#+end_export
where $\Lambda_{0j}$ is the baseline cumulative hazard for cause j, which is defined as $\Lambda_{0j}(t) = \int_0^t \lambda_{0j}(s)ds$, where $\lambda_{0j}$ is the baseline hazard. The baseline hazard is however not estimated when fitting a cause-specific cox model. Now define the survival function using the product integral as
#+begin_export latex
\begin{align*}
S(t|x) = \prod_{s \leq t}\left(1-d\Lambda_1(s|x)-d\Lambda_2(s|x)\right),
\end{align*}
#+end_export
or using the exponential approximation
#+begin_export latex
\begin{align*}
S(t|x) = \exp(-\Lambda_1(t|x)-\Lambda_2(t|x)).
\end{align*}
#+end_export
We can then write the cumulative incidence function for cause $j$, $F_j(t|x) = P(T\leq t, D = j|X)$, as
#+begin_export latex
\begin{align*}
F_j(t|x) = \int_0^t S(s-|x)d\Lambda_j(s|x).
\end{align*}
#+end_export
The problem I will look at is that current methods of estimation of the cause-specific risks estimates the cause-specific cumulative incidence functions seperately. The problem with this is that it can lead to wrong estimations, which can easily be verified as it can happen that for $\tau$ and some $x^*$
#+begin_export latex
\begin{align}
F_1(\tau|x^*)+F_2(\tau|x^*)>1.
\end{align}
#+end_export
I will in this project develope a method to estimate the risks simultaniously such that the above can't happen. MAYBE ALSO MENTION THE PROPORTIONAL HAZARDS ASSUMPTION, AND THAT BY USING BRIER-SCORE AS ESTIMATOR WE DON'T NEED THAT ASSUMPTION AS WE OPTIMIZE THE PARAMETERS FOR A GIVEN \tau, AND DONT OPTIMIZE FOR THE WHOLE TIME PERIOD. Maybe this should also be the new goal instead of the "estimation of all causes simultaniously" goal. i.e. "In this project we aim to develope an estimation method based on the proportional hazards model that do not need the proportional hazards assumption". This is interresting as the proportional hazards model is so popular and being able to still use it while having an assumption less is huge.  


* Different loss functions

** Likelihood function
Asume we have $N$ datapoints and $K$ different causes. The general parametric likelihood function in a competing risks setting can be written as:
#+begin_export latex
\begin{align*}
L = \prod_{i = 1}^N\lambda_{j_i}(t_i|x_i)^{d_i}S(t_i|x_i),
\end{align*}
#+end_export
where $d_i$ is 1 if an event was observed and 0 if $i$ is censored, and $j_i$ is which event occured for person $i$. Using that the survival function is a product of the individual cause-specific survival functions, $S(t_i|x_i) = \prod S_j(t_i|x_i)$, we can write the likelihood as:
#+begin_export latex
\begin{align*}
L &= \prod_{i = 1}^N\lambda_{j_i}(t_i|x_i)^{d_i}\prod_{j = 1}^K\exp(-\Lambda_j(t_i|x_i))\\
&= \prod_{i = 1}^N\prod_{j = 1}^K\lambda_{j_i}(t_i|x_i)^{d_{ij}}\exp(-\Lambda_j(t_i|x_i)).
\end{align*}
#+end_export
This means that the likelihood function is a product of K likelihoods, one for each cause. We can then maximize this likelihood by maximizing each cause-specific likelihood function, as long as the parameters are different for each cause.

*** Likelihood estimating equations
Assume two causes, only one covariate and constant baseline hazards. I then differentiate the log-likelihood functions with respect to the parameters. The negative log-likelihood function for cause $j$ is then:
#+begin_export latex
\begin{align*}
-\log(L_j) = \sum_{i = 1}^N-d_{ij}(\beta_jx_i+\log(\lambda_{0j}))+t_i\exp(\beta_jx_i)\lambda_{0j}
\end{align*}
#+end_export
and differentiated
#+begin_export latex
\begin{align*}
\frac{d-\log(L_j)}{d\beta_j} = \sum_{i = 1}^N-d_{ij}x_i+t_ix_i\exp(\beta_jx_i)\lambda_{0j}
\end{align*}
#+end_export
#+begin_export latex
\begin{align*}
\frac{d-\log(L_j)}{d\lambda_{0j}} = \sum_{i = 1}^N-\frac{d_{ij}}{\lambda_{0j}}+t_i\exp(\beta_jx_i)
\end{align*}
#+end_export


