Project1_constrained_risk_prediction/manuscript/manuscript.org
** Brier score
As our target in risk prediction is to minimize the Brier-score, it makes sense to fit the models by choosing the parameters which minimizes the brier-score. By using the Brier-score as our loss function, we also optimize our parametres based on a single timepoint (the prediction horizon), which is of great interrest in risk prediction. The model produced by minimizng the Brier-score will also be fully parametric, which will allows us to easily used it outside of online enviroments like DST.
\\
Assuming we have $N$ datapoints of the form $(\tilde{T},\tilde{D},X)$ where $\tilde{T}\in (0,\infty)$ is the observed time (time to first observed event), $\tilde{D}\in\{1,2,...,k\}$ is the observed event and $X$ is a p-dimensional covariate vector. The Brier-Score for predicting cause $j$ at timepoint $\tau$ can be written as
#+begin_export latex
\begin{align*}
BS = \frac{1}{N}\sum_{i = 1}^N(F_j(\tau|x_i)-o_i(\tau,j))^2,
\end{align*}
#+end_export
where $o_i(\tau,j)$ is the true outcome of person $i$, i.e. $o_i(\tau,j) = 1(\tilde{D}_i= j,\tilde{T}_i\leq \tau)$. Assume $K$ different causes and assume no censoring (with censoring just add a 0 state such that we have $K+1$ states and the setup will be similar to that of the joint survival super learner). We then want to find the parameters that minimize the Brier-score or all causes i.e.
#+begin_export latex
\begin{align*}
BSS = &\arg\min_{\boldsymbol{\beta}\in\mathbb{R},\boldsymbol{\Lambda_0}\in\mathbb{R}^+}\sum_{j = 1}^K\frac{1}{N}\sum_{i = 1}^N(F_j(\tau|x_i,\boldsymbol{\beta},\boldsymbol{\Lambda_0})-o_i(\tau,j))^2\\
= &\arg\min_{\boldsymbol{\beta}\in\mathbb{R},\boldsymbol{\Lambda_0}\in\mathbb{R}^+}\frac{1}{N}\sum_{j = 1}^K\sum_{i = 1}^N\left(\int_0^{\tau} S(s-|x_i,\boldsymbol{\beta},\boldsymbol{\Lambda_0})d\Lambda_j(s|x_i,\boldsymbol{\beta}_j,\Lambda_{0j})-o_i(\tau,j)\right)^2,
\end{align*}
#+end_export
where $\boldsymbol{\beta}$ are the beta coeffecients for all causes and $\boldsymbol{\Lambda_0}$ are the baseline hazards, with j indicating the coeffecients for the specific cause. BSS = Brier-score-sum. This is actually just the Brier-score as it was written by Brier in the orginal paper. 



*** Find estimating equations in Parametric Cox with exponential baseline hazard
Assume we are in a competing risks setting with two causes and one covariate $x$, and we are interrested in predicting the risk of experiencing the events before or at timepoint $\tau$ using a cox model and let $\phi = \{\beta_1,\beta_2,\Lambda_{01},\Lambda_{02}\}$. First we take the simpler example and use the exponential approximation of the survival function and assume a constant baseline hazard. The hazard for cause $j$ will the be
#+begin_export latex
\begin{align*}
\lambda_j = \exp(\beta_jx)\lambda_{0j},
\end{align*}
#+end_export
where $\lambda_{0j}$ is some constant. We are interested in solving this:
#+begin_export latex
\begin{align*}
BSS=\arg\min_{\beta_1,\beta2\in\mathbb{R},\lambda_{01},\lambda_{02}\in\mathbb{R}^+}\frac{1}{N}\sum_{j = 1}^2\sum_{i = 1}^N\left(g_j(\phi)-o_i(\tau,j)\right)^2.
\end{align*}
#+end_export
First I rewrite $g_1(\phi) = \int_0^{\tau} S(s-|x,\boldsymbol{\beta},\boldsymbol{\Lambda_0})\lambda_1(s|x,\boldsymbol{\beta}_1,\Lambda_{01})ds$ from the Brier-score written above (note that $g_1$ is equal to $F_1$ for a fixed timepoint $\tau$):
#+begin_export latex
\begin{align*}
g_1(\phi)&= \int_0^{\tau}\exp\left[-\exp(\beta_1x)\Lambda_{01}(s-)-\exp(\beta_2x)\Lambda_{02}(s-)\right]\exp(\beta_1x)\lambda_{01}ds\\
&=\exp(\beta_1x)\lambda_{01}\int_0^{\tau}\exp\left[-\exp(\beta_1x)s^-\lambda_{01}-\exp(\beta_2x)s^-\lambda_{02}\right]ds\\
&=\exp(\beta_1x)\lambda_{01}\frac{\exp\left[\tau^-(-\exp(\beta_1x)\lambda_{01}-\exp(\beta_2x)\lambda_{02})\right]-1}{-\exp(\beta_1x)\lambda_{01}-\exp(\beta_2x)\lambda_{02}}\\
&=\exp(\beta_1x)\lambda_{01}\frac{1-\exp\left[\tau^-(-\exp(\beta_1x)\lambda_{01}-\exp(\beta_2x)\lambda_{02})\right]}{\exp(\beta_1x)\lambda_{01}+\exp(\beta_2x)\lambda_{02}}
\end{align*}
#+end_export
As we are in continous time $\tau^-= \tau$. Then we differentiate $g_1$ with respect to $\beta_1$, $\beta_2$, $\lambda_{01}$ and $\lambda_{02}$ (to get the result for $g_2$ just swap all the 1's and 2's, also the ones on the left side of the equals sign):
#+begin_export latex
\begin{align*}
\frac{\partial g_1(\phi)}{\partial\beta_1} = &\frac{x \lambda_{01} e^{x \beta_1}}{\left(\lambda_{01} e^{x \beta_1} + \lambda_{02} e^{x \beta_2}\right)^2}\\
&\cdot\left[
\lambda_{02} e^{x \beta_2}\left(1 - e^{-\tau\left(\lambda_{01} e^{x \beta_1} + \lambda_{02} e^{x \beta_2}\right)}\right)
+ \tau \lambda_{01} e^{x \beta_1}\left(\lambda_{01} e^{x \beta_1} + \lambda_{02} e^{x \beta_2}\right)e^{-\tau\left(\lambda_{01} e^{x \beta_1} + \lambda_{02} e^{x \beta_2}\right)}
\right]
\end{align*}
#+end_export
#+begin_export latex
\begin{align*}
\frac{\partial g_1(\phi)}{\partial\beta_2} =\frac{xe^{\beta_1x}\lambda_{01}e^{\beta_2x}\lambda_{02}}{(e^{\beta_1x}\lambda_{01}+e^{\beta_2x}\lambda_{02})^2}\left[(1+\tau(e^{\beta_1x}\lambda_{01}+e^{\beta_2x}\lambda_{02}))e^{-(e^{\beta_1x}\lambda_{01}+e^{\beta_2x}\lambda_{02})\tau}-1\right]
\end{align*}
#+end_export
#+begin_export latex
\begin{align*}
&\frac{\partial g_1(\phi)}{\partial \lambda_{01}}
=\frac{e^{\beta_1 x}}{\left(e^{\beta_1 x}\lambda_{01}+e^{\beta_2 x}\lambda_{02}\right)^2}\\
&\cdot\left[e^{\beta_2 x}\lambda_{02}\left(1-e^{-\tau\left(e^{\beta_1 x}\lambda_{01}+e^{\beta_2 x}\lambda_{02}\right)}\right)+\tau e^{\beta_1x}\lambda_{01}\left(e^{\beta_1 x}\lambda_{01}+e^{\beta_2 x}\lambda_{02}\right)e^{-\tau\left(e^{\beta_1 x}\lambda_{01}+e^{\beta_2 x}\lambda_{02}\right)}\right]
\end{align*}
#+end_export
#+begin_export latex
\begin{align*}
\frac{\partial g_1(\phi)}{\partial\lambda_{02}} = \frac{e^{\beta_1x}\lambda_{01}e^{\beta_2x}}{(e^{\beta_1x}\lambda_{01}+e^{\beta_2x}\lambda_{02})^2}\left[(1+\tau(e^{\beta_1x}\lambda_{01}+e^{\beta_2x}\lambda_{02}))e^{-(e^{\beta_1x}\lambda_{01}+e^{\beta_2x}\lambda_{02})\tau}-1\right]
\end{align*}
#+end_export
Using this we can now differentiate the Brier-Score (BS) with respect to the betas to get the estimating equations:
#+begin_export latex
\begin{align*}
\frac{\partial BSS(\phi)}{\partial\beta_1} &=\frac{1}{N}\sum_{j = 1}^K\sum_{i = 1}^N \frac{dg_j(\phi)}{\beta_1}2(g_j(\phi)-o_i(t,j))\\
&= 0
\end{align*}
#+end_export
#+begin_export latex
\begin{align*}
\frac{\partial BSS(\phi)}{\partial\beta_2} &=\frac{1}{N}\sum_{j = 1}^K\sum_{i = 1}^N \frac{dg_j(\phi)}{\beta_2}2(g_j(\phi)-o_i(t,j))\\
&= 0
\end{align*}
#+end_export
#+begin_export latex
\begin{align*}
\frac{\partial BSS(\phi)}{\partial\lambda_{01}} &=\frac{1}{N}\sum_{j = 1}^K\sum_{i = 1}^N \frac{dg_j(\phi)}{\lambda_{01}}2(g_j(\phi)-o_i(t,j))\\
&= 0
\end{align*}
#+end_export
#+begin_export latex
\begin{align*}
\frac{\partial BSS(\phi)}{\partial\lambda_{02}} &=\frac{1}{N}\sum_{j = 1}^K\sum_{i = 1}^N \frac{dg_j(\phi)}{\lambda_{02}}2(g_j(\phi)-o_i(t,j))\\
&= 0
\end{align*}
#+end_export
Note that the $\frac{1}{N}$ terms can be removed.


*** COMMENT Using Cox-Weibull
The hazard function for the Cox-Weibull model for cause j is
#+begin_export latex
\begin{align*}
\h_j(t|x) = \lambda_j\exp(\beta_jx)v_jt^{v_j-1},
\end{align*}
#+end_export
where $\lambda_j>0$ is the scale parameter and $v_j>0$ is the shape parameter. The baseline hazard is
#+begin_export latex
\begin{align*}
h_{0,j}(t) = \lambda_jv_jt^{v_j-1},
\end{align*}
#+end_export
and the cumulative baseline hazard function is
#+begin_export latex
\begin{align*}
H_{0,j}(t) = \lambda_jt^{v_j}.
\end{align*}
#+end_export
This means the survival function will be
#+begin_export latex
\begin{align*}
S(t|x) = \exp(-(\exp(\beta_1x)\lambda_1t^{v_1}+\exp(\beta_2x)\lambda_2t^{v_2})),
\end{align*}
#+end_export
and the cumulative incidence function for cause 1 is
#+begin_export latex
\begin{align*}
F_1(t|x)
&= \int_0^t\exp(-(\exp(\beta_1x)\lambda_1s^{v_1}+\exp(\beta_2x)\lambda_2s^{v_2}))\lambda_1\exp(\beta_1x)v_1s^{v_1-1}ds.
\end{align*}
#+end_export
The cumulative incidence function does not have a closed form, so it needs to be numerical approximated in practise.

