Project1_constrained_risk_prediction/manuscript/manuscript.tex


\section*{Estimation with constraint}
\label{sec:org4aa471a}

Assuming we have \(N\) datapoints, the Brier-Score for predicting cause \(j\) at timepoint \(\tau\) can be written as
\begin{align*}
BS_j = \frac{1}{N}\sum_{i = 1}^N(F_j(\tau|x_i)-o_i(\tau,j))^2,
\end{align*}
where \(o_i(\tau,j)\) is the true outcome of person \(i\) (1 if event j is the observed event and has happened at or before timepoint t and 0 otherwise). Furthermore assume only two competing risks (T2D and death). We then want to find the parameters that minimize this score i.e.
\begin{align*}
&\arg\min_{\boldsymbol{\beta}\in\mathbb{R}}\sum_{j = 0}^K\frac{1}{N}\sum_{i = 1}^N(F_j(\tau|x_i,\boldsymbol{\beta})-o_i(\tau,j))^2.
\end{align*}
In our setting \(K = 2\) where \(j = 0\) is the censored state and 1 and 2 are T2D and death. We need to minimize this score under some constraint, for example:
\begin{align*}
\sum_{j = 0}^K F_j(\tau|x,\boldsymbol{\beta})\leq 1 \text{ for all x},
\end{align*}
or
\begin{align*}
\frac{d}{d\beta_{age}}F_j(\tau|x_i,\boldsymbol{\beta})>0
\end{align*}
for some \(j\). In the T2D and death example \(j\in\{1,2\}\), as those risks should increase with age. In practise in may be easier to rewrite the minimization problem to:
\begin{align*}
&\arg\min_{\boldsymbol{\beta}\in\mathbb{R}}\sum_{j = 0}^K\frac{1}{N}\sum_{i = 1}^N(F_j(\tau|x_i,\boldsymbol{\beta})-o_i(\tau,j))^2+ I\left(\frac{d}{d\beta_{age}}F_j(\tau|x_i,\boldsymbol{\beta})\leq0\right),
\end{align*}
i.e. add the constraint to the loss function as a new term which will be 0 if the constraint holds and 1 otherwise which is large as we are using the Brier-score. We should probably multiply the indicator function with \(K+1\), as we sum \(K+1\) Brier-scores. \\[0pt]
If we want methods like Newton-Raphson to work we probably need to use a different method as above, as the loss-function need to be smooth. Say we have the constraint \(g(\beta)\leq 0\) then we can use the loss function:
\begin{align*}
&\arg\min_{\boldsymbol{\beta}\in\mathbb{R}}\sum_{j = 0}^K\frac{1}{N}\sum_{i = 1}^N(F_j(\tau|x_i,\boldsymbol{\beta})-o_i(\tau,j))^2+\lambda\max(0,g(\beta))
\end{align*}
where \(\lambda\) is some penalization parameter. 

\section*{Censoring}
\label{sec:org1832aed}
The BSS handles censoring well as is, and outperforms everything in the simulation study. Why?


\section*{Simulation study}
\label{sec:org00767df}

We want to test our method in four different setups: first where the model is correctly specified, second where the model is not correctly specified but still proportional hazards and one where the proportional hazards assumption doesnt hold. This is done by simulating data from parametric Cox models, with different baseline hazards: first it will be exponentially distributed, second it will be Weibull distributed, and lastly it will be Weibull where the shape parameter will depend on covariates. This will be done both with and without censoring, where the censoring process is Cox-weibull. In all the simulations the models will be fitted using 70 percent of the data, and evaluated by calculating the BSS on the 30 percent of data not used for training.

We test our estimation method against the exponential-Cox model estimated using maximum likelihood, the logistic regression model and the standard Cox proportional hazards model.

\subsection*{Correctly specified model (Sim-setup 1)}
\label{sec:org0e9697a}
In this setup we are interrested in two things: See if our method finds the true parameters and compare model performance between BSE and other models. The results of these simlation studies can found in the simulation\textsubscript{study} folder in the targets: does\textsubscript{BS}\textsubscript{find}\textsubscript{correct}\textsubscript{pars}, simulation\textsubscript{cox}\textsubscript{exp}, simulation\textsubscript{cox}\textsubscript{exp}\textsubscript{cens}.

Brier-score estimation does indeed find the data-generating parameters, but can fail if the starting parameters are chosen poorly. When data contains no censoring all the methods perform approximately the same, with the Oracle estimator performing best and the BSE performing worst. The models also perform almost equal when about 30 percent of the data is right censored, but here the BSE performs best and the logistic model perfroms worst.

\subsection*{Not correctly specified (Sim-setup 2)}
\label{sec:org6b54da1}
All the methods perform approximately the same when there is no censoring in the data. When introducing censoring the BSE outperforms the rest.


\subsection*{Non-proptional hazards model (Sim-setup 3)}
\label{sec:org1f5018d}
When data violates the proportional hazards assumption the BSE outperforms all the other methods, both when data contains censoring and when no censoring is occuring.


\subsection*{Choosing starting parameters}
\label{sec:org179593e}

The optimal way to choose starting parameters for the optimizer would be to try many different values for each parameter and choose the best outcome. However this is computational heavy and time comesuming. A good way to choose starting parameters I have found is to use the parameters from a fitted Cox model. Note that we can never be sure if we have found the true minimum of the BSS.


\section*{"Real" data example}
\label{sec:orgbc1b9bf}
Here we test our method on synthetic data that mimics the data used for the Steno1-risk-engine (USE DATA FROM DP-NEXT INSTEAD), and show the performance against the Cox-proportional hazards model. 
\end{document}
